{
  "_class_name": "ConsistencyDecoderVAE",
  "_diffusers_version": "0.23.0.dev0",
  "_name_or_path": "openai/consistency-decoder",
  "decoder_add_attention": false,
  "decoder_block_out_channels": [320, 640, 1024, 1024],
  "decoder_down_block_types": [
    "ResnetDownsampleBlock2D",
    "ResnetDownsampleBlock2D",
    "ResnetDownsampleBlock2D",
    "ResnetDownsampleBlock2D"
  ],
  "decoder_downsample_padding": 1,
  "decoder_in_channels": 7,
  "decoder_layers_per_block": 3,
  "decoder_norm_eps": 1e-5,
  "decoder_norm_num_groups": 32,
  "decoder_num_train_timesteps": 1024,
  "decoder_out_channels": 6,
  "decoder_resnet_time_scale_shift": "scale_shift",
  "decoder_time_embedding_type": "learned",
  "decoder_up_block_types": [
    "ResnetUpsampleBlock2D",
    "ResnetUpsampleBlock2D",
    "ResnetUpsampleBlock2D",
    "ResnetUpsampleBlock2D"
  ],
  "encoder_act_fn": "silu",
  "encoder_block_out_channels": [128, 256, 512, 512],
  "encoder_double_z": true,
  "encoder_down_block_types": [
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D",
    "DownEncoderBlock2D"
  ],
  "encoder_in_channels": 3,
  "encoder_layers_per_block": 2,
  "encoder_norm_num_groups": 32,
  "encoder_out_channels": 4,
  "latent_channels": 4,
  "scaling_factor": 0.18215
}
