{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": true,
      "rstrip": true,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": true,
      "rstrip": true,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Lowercase"
      },
      {
        "type": "Replace",
        "pattern": {
          "Regex": "[!\"\\#\\$%\\&'\\(\\)\\*\\+,\\-\\.:;=\\?@\\[\\\\\\]\\^_`\\{\\|\\}\\~]"
        },
        "content": ""
      },
      {
        "type": "Replace",
        "pattern": {
          "Regex": "\\s+"
        },
        "content": " "
      },
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      },
      {
        "type": "Precompiled",
        "precompiled_charsmap": 